# **DATA ANALYSIS ON SF SALARIES**

In [1]:
import pandas as pd
import numpy as np

In [2]:
salary_df =  pd.read_csv('/home/user/Datasets/Salaries.csv')
salary_df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [3]:
salary_df.shape

(148654, 13)

In [4]:
salary_df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [5]:
salary_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [6]:
# Average Base pay
salary_df['BasePay'].mean()

66325.44884050643

In [7]:
# highest value of OvertimePay
salary_df['OvertimePay'].max()

245131.88

In [8]:
# job title of JOSEPH DRISCOLL 

salary_df[salary_df['EmployeeName'] == 'JOSEPH DRISCOLL'][['EmployeeName', 'JobTitle']]

       EmployeeName                   JobTitle
24  JOSEPH DRISCOLL  CAPTAIN, FIRE SUPPRESSION

In [9]:
# how much does JOSEPH DRISCOLL make including benefits

salary_df[salary_df['EmployeeName'] =='JOSEPH DRISCOLL'][['EmployeeName','Benefits', 'TotalPay', 'TotalPayBenefits']]

       EmployeeName  Benefits   TotalPay  TotalPayBenefits
24  JOSEPH DRISCOLL       NaN  270324.91         270324.91

In [10]:
# Name of the highest paid person including benefits

salary_df[salary_df['TotalPayBenefits'] == salary_df['TotalPayBenefits'].max()][['EmployeeName','TotalPayBenefits']]

     EmployeeName  TotalPayBenefits
0  NATHANIEL FORD         567595.43

In [11]:
# Name of the person with highest benefit and his salary including benefits

salary_df[salary_df['Benefits'] == salary_df['Benefits'].max()][['EmployeeName','Benefits', 'TotalPay', 'TotalPayBenefits']]

                EmployeeName  Benefits  TotalPay  TotalPayBenefits
110533  William J Coaker Jr.  96570.66  339653.7         436224.36

In [12]:
# Name of lowest paid person (including benefits)
salary_df[salary_df['TotalPayBenefits'] == salary_df['TotalPayBenefits'].min()][['EmployeeName','TotalPayBenefits']]

       EmployeeName  TotalPayBenefits
148653    Joe Lopez           -618.13

In [13]:
# The average (mean) BasePay of all employees per year
salary_df.groupby('Year')[['BasePay']].mean()

           BasePay
Year
2011  63595.956517
2012  65436.406857
2013  69630.030216
2014  66564.421924

In [14]:
# NUmber of unique job titles
salary_df['JobTitle'].nunique()

2159

In [15]:
# Top 5 most common jobs
salary_df['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [16]:
# top 5 most paid 
salary_df.nlargest(5,'TotalPayBenefits')[['EmployeeName', 'JobTitle','TotalPayBenefits']]

,EmployeeName,JobTitle,TotalPayBenefits
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,567595.43
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),538909.28
110531,David Shinn,Deputy Chief 3,510732.68
110532,Amy P Hart,Asst Med Examiner,479652.21
110533,William J Coaker Jr.,Chief Investment Officer,436224.36

In [17]:
# Number of Job Titles occupied by only one person in 2013
sum(salary_df[salary_df['Year']==2013]['JobTitle'].value_counts() ==1)

202

In [25]:
# Number of people have the word Chief in their job title
salary_df[salary_df['JobTitle'].str.match('Chief')]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
36160,36161,Gregory Suhr,Chief of Police,302578.00,0.00,18974.11,69810.19,321552.11,391362.30,2012,NaN,San Francisco,NaN
36162,36163,Joanne Hayes-White,"Chief, Fire Department",296943.01,0.00,17816.59,72047.88,314759.60,386807.48,2012,NaN,San Francisco,NaN
36345,36346,Burk Delventhal,Chief Atty1 (Civil & Criminal),206752.00,0.00,312.50,64406.22,207064.50,271470.72,2012,NaN,San Francisco,NaN
36419,36420,Joanne Hoeper,Chief Atty1 (Civil & Criminal),201384.40,0.00,312.50,60796.93,201696.90,262493.83,2012,NaN,San Francisco,NaN
36420,36421,Wendy Still,Chief Adult Probation Officer,192454.46,0.00,5185.04,64849.52,197639.50,262489.02,2012,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
138011,138012,Sharon C Jackson,Chief Deputy Adlt Probation Of,56660.18,0.00,0.00,566.61,56660.18,57226.79,2014,NaN,San Francisco,NaN
139620,139621,Anita S Lee,Chief Clerk,38598.86,0.00,0.00,386.00,38598.86,38984.86,2014,NaN,San Francisco,NaN
139709,139710,George D Vaughan,Chief Nursery Specialist,27319.47,483.90,0.00,10334.67,27803.37,38138.04,2014,NaN,San Francisco,NaN
140080,140081,Patrick W Gillespie,Chief Preparator,24091.00,0.00,0.00,10176.77,24091.00,34267.77,2014,NaN,San Francisco,NaN
140156,140157,Christopher L Ochoa,Chief Stationary Engineer,24392.00,418.71,0.00,8918.44,24810.71,33729.15,2014,NaN,San Francisco,NaN

In [19]:
# Is there a correlation between length of the Job Title string and Salary